###############################################################################
# Created by write_sdc
# Sun Jun  8 00:13:49 2025
###############################################################################
current_design semi_cpu_top
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name core_clock -period 10.0000 [get_ports {clk}]
set_propagated_clock [get_clocks {core_clock}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
